def menu():
    print("Выберите число от 1 до 13")
    print("1. Выбрать вид кухни")
    print("2. Выбрать средний чек")
    print("3. Выбрать по времени работы")
    print("4. Выбрать по кол-ву звезд")
    print("5. Выбрать по наличию доставки")
    print("6. Выбрать по типу заведения")
    print("7. Выбрать по наличию бизнес-ланча")
    print("8. Выбрать по наличию завтрака")
    print("9. Выбрать по наличию детского меню")
    print("10. Выбрать по наличию барного меню")
    print("11. Сбросить характеристики")
    print("12. Вывести список заведений")
    print("13. Завершить программу")



def menuForTypeOfKitchen():
    print("Выберите тип кухни")
    print("1. Европейская")
    print("2. Морепродукты")
    print("3. Итальянская")
    print("4. Американская")
    print("5. Азиатская")
    print("6. Ирландская")
    print("7. Грузинская")
    print("8. Русская")
    print("9. Стрит Фуд")
    print("10. Французская")
    print("Выберите число от 1 до 10")


def menuForAveragePrise():
    print("Выберите средний чек")
    print("1. до 500р")
    print("2. до 1000р")
    print("3. до 1500р")
    print("4. до 2000р")
    print("5. до 2500р")
    print("6. дорого-богато")
    print("Выберите число от 1 до 6")


def menuForWorkTime():
    print("Выберите время в которое заведение открыто")
    print("1. утреннее (с 8 до 12 включительно)")
    print("2. дневное (с 13 до 16 включительно)")
    print("3. вечернее (с 17 до 22 включительно)")
    print("4. ночное (с 23 до 3 включительно)")
    print("Выберите число от 1 до 4")


def menuForStars():
    print("Выберите оценку")
    print("1. 1 звезда и выше")
    print("2. 2 звезды и выше")
    print("3. 3 звезды и выше")
    print("4. 4 звезды и выше")
    print("4. 5 звезд")
    print("Выберите число от 1 до 5")


def menuForDelivery():
    print("Выберите есть ли доставка")
    print("1. Да")
    print("2. Нет")
    print("Выберите число 1 или 2")


def menuForType():
    print("Выберите тип заведения")
    print("1. Кондитерская")
    print("2. Ресторан")
    print("3. Кафе")
    print("4. Бар")
    print("5. Магазин Выпечки")
    print("Выберите число от 1 до 5")


def menuForLunch():
    print("Выберите есть ли ланч")
    print("1. Да")
    print("2. Нет")
    print("Выберите число 1 или 2")


def menuForBreakfast():
    print("Выберите есть ли завтрак")
    print("1. Да")
    print("2. Нет")
    print("Выберите число 1 или 2")


def menuForChild():
    print("Выберите есть ли детское меню")
    print("1. Да")
    print("2. Нет")
    print("Выберите число 1 или 2")


def menuForBar():
    print("Выберите есть ли барное меню")
    print("1. Да")
    print("2. Нет")
    print("Выберите число 1 или 2")